//STL(Standard Template Library)
//표준 템플릿 라이브러리
//자료 구조 , 함수 , 알고리즘 활용에 도움을 주는 라이브러리 파일(헤더 파일)
//STL의 구성 요소
//1. 알고리즘 : 특정 로직에 대한 구현
//2. 컨테이너 : 데이터 자료 구조(C언어의 배열처럼 동일 요소를 모아놓은 데이터 덩어리)
//             배열과 다르게 고정된 크기가 아닌 동적으로 크기 변경이 가능
//			  순차(sequence) : 여러 개 데이터를 순번으로 저장할 수 있습니다.
//			  - vector(벡터) : 크기를 수정할 수 있는 배열(가변 배열)
//			  - deque(덱) : 양방향으로 데이터를 저장할 수 있는 자료구조
//			  - list(리스트)	 : 모든 위치에서의 추가 , 삭제가 동일한 시간으로 처리되는 자료구조	  
//			  정렬(sorted) : 여러 개의 데이터를 key를 기반으로 찾아내며 순번이 없습니다.
//			  - set(셋) : 집합, 중복된 키가 허용되지 않습니다.
//			  - map(맵) : 키와 데이터가 하나의 묶음으로 제공됩니다.
//						ex) 키(비밀번호) - 데이터(1234)
//						  키는 중복이 될 수 없습니다.(아파트에 101호가 2개 존재할 수 없다.)
//3. 함수자 :
//4. 반복자 :
#include <iostream>